shawn83924/SpeedySolution/TAIFEXLib/TMPMessage.h
//
// File:   TMPMessage.h
// Author: Simon Chang
//   
// Created on June 15, 2008, 10:27 PM
//
//------------------------------------------------------------------------------------------------------
#ifndef _TMPMESSAGE_H
#define	_TMPMESSAGE_H
//------------------------------------------------------------------------------------------------------
#include "TMPTypes.h"
#include "TMPDataFormat.h"
#include "TMPMessage.h"
#include "../UFC/ThreadObjectPool.h"
//-----------------------------------------------------------------------------------------
namespace TMP
{
using  namespace UFC;
//----------------------------------------------------------------------------------------------------------------------
typedef enum
{
    tlmOptions = 10,
    tlmFutures = 20,
    tlmBoth    = 30

}TMPLibMarket;

//----------------------------------------------------------------------------------------------------------------------
typedef enum 
{
    // Link sub-system messages( for both Options and Futures)
    tmtL10 = 10, ///< startup notify   ( TAIFEX <-> FCM )
    tmtL20 = 20, ///< startup confirm  ( TAIFEX <-- FCM )
    tmtL30 = 30, ///< Logon notify     ( TAIFEX --> FCM )
    tmtL40 = 40, ///< Logon request    ( TAIFEX <-- FCM )
    tmtL41 = 41, ///< Recover          ( TAIFEX --> FCM )
    tmtL42 = 42, ///< Recover confirm  ( TAIFEX <-- FCM )
    tmtL50 = 50, ///< Logon Response   ( TAIFEX --> FCM )
    tmtL60 = 60, ///< Logon confirm    ( TAIFEX <-- FCM )
    tmtL70 = 70, ///< End session      ( TAIFEX <-- FCM )
    tmtL80 = 80, ///< End confirm      ( TAIFEX --> FCM )
            
    tmtLX30 = 230, ///< FLEX Logon notify     ( TAIFEX --> FCM )            
    // Order sub-system message.
    tmtR01 = 101, ///< New Order
    tmtR02 = 102, ///< Execution Report
    tmtR22 = 122, ///< Execution Report
    tmtR03 = 103, ///< Reject execution
    tmtR04 = 104, ///< Heartbeat 
    tmtR05 = 105, ///< Heartbeat response
    tmtR07 = 107, ///< Quote Request
    tmtR08 = 108, ///< Quote Request response
    tmtR09 = 109, ///< Quote 
    tmtR11 = 111, ///< Trading Session Status request
    tmtR12 = 112, ///< Trading Session Status    
    tmtR13 = 113, ///< News request message
    tmtR14 = 114, ///< News response message
    tmtR15 = 115, ///< CM Exceution request message 
    tmtR16 = 116, ///< CM Exceution response message
    tmtR17 = 117, ///< TMP system setting message
    tmtR18 = 118, ///< TMP system notify messsage
    //< FLEX message.        
    tmtRX01 = 201, ///< New FLEX Order
    tmtRX02 = 202, ///< Execution Report       
    tmtRX03 = 203, ///< Reject execution       
    tmtRX07 = 207, ///< Quote Request                    
    tmtRX08 = 208, ///< Quote Request response
    tmtRX09 = 209, ///< Quote 
    tmtRX13 = 213, ///< News request message       
    tmtRX14 = 214, ///< News response message       
    tmtRX15 = 215, ///< CM Exceution request message         
    tmtRX16 = 216, ///< CM Exceution response message       
    tmtRX19 = 219, ///< New FLEX product request       
    tmtRX20 = 220, ///< New FLEX product response message       
    tmtRX40 = 240, ///< Recover executions request. (Like L40)
    tmtRX41 = 241, ///< Recover executions. (Like L41)
    tmtRX42 = 242, ///< Stop recover.
    // New Message, with Long Symbol support.
    tmtR31 = 131, ///< New Order (with Long Symbol support)
    tmtR32 = 132, ///< Execution Report (with Long Symbol support) 
    tmtR37 = 137, ///< Quote Request (with Long Symbol support)
    tmtR38 = 138, ///< Quote Request response (with Long Symbol support)
    tmtR39 = 139  ///< Quote (with Long Symbol support) 
     

} TMPMessageType;
//----------------------------------------------------------------------------------------------------------------------
const int R01_ExecType       = 0;
const int R01_cm_id          = 1;
const int R01_fcm_id         = 2;
const int R01_order_no       = 3;
const int R01_ord_id         = 4;
const int R01_user_define    = 5;
const int R01_Symbol         = 6;
const int R01_Price          = 7;
const int R01_qty            = 8;
const int R01_investor_acno  = 9;
const int R01_investor_flag  = 10;
const int R01_Side           = 11;
const int R01_OrdType        = 12;
const int R01_TimeInForce    = 13;
const int R01_PositionEffect = 14;
const int R01_order_source   = 15;
const int R01_info_source    = 16;
//------------------------------------------------------------------------------
const int R02_status_code    =  0;
const int R02_ExecType       =  1;
const int R02_cm_id          =  2;
const int R02_fcm_id         =  3;
const int R02_order_no       =  4;
const int R02_ord_id         =  5;
const int R02_user_define    =  6;
const int R02_Symbol         =  7;
const int R02_Price          =  8;
const int R02_qty            =  9;
const int R02_investor_acno  = 10;
const int R02_investor_flag  = 11;
const int R02_Side           = 12;
const int R02_OrdType        = 13;
const int R02_TimeInForce    = 14;
const int R02_PositionEffect = 15;
const int R02_LastPx         = 16;
const int R02_LastQty        = 17;
const int R02_px_subtotal    = 18;
const int R02_CumQty         = 19;
const int R02_LeavesQty      = 20;
const int R02_before_qty     = 21;
const int R02_leg_side1      = 22;
const int R02_leg_side2      = 23;
const int R02_leg_px1        = 24;
const int R02_leg_px2        = 25;
const int R02_leg_qty1       = 26;
const int R02_leg_qty2       = 27;
const int R02_org_trans_time = 28;
const int R02_TransactTime   = 29;
const int R02_target_id      = 30;
const int R02_uniq_id        = 31;
const int R02_rpt_seq        = 32;
const int R02_protocol_type  = 33;
//------------------------------------------------------------------------------
const int R22_status_code    =  0;
const int R22_ExecType       =  1;
const int R22_fcm_id         =  2;
const int R22_order_no       =  3;
const int R22_ord_id         =  4;
const int R22_user_define    =  5;
const int R22_Side           =  6;
const int R22_PositionEffect =  7;
const int R22_LeavesQty      =  8;
const int R22_before_qty     =  9;
const int R22_leg_px1        = 10;
const int R22_leg_px2        = 11;
const int R22_leg_qty1       = 12;
const int R22_leg_qty2       = 13;
const int R22_TransactTime   = 14;
const int R22_uniq_id        = 15;
const int R22_rpt_seq        = 16;
const int R22_protocol_type  = 17;
const int R22_Price          = 18;
//------------------------------------------------------------------------------------------------------
const UInt16 FCM_NOT_EXIST = 9999;
//------------------------------------------------------------------------------------------------------
class SymbolInfo
{
public:
	UFC::AnsiString Symbol;
	int             Index;
	int             DecimalLocator;
public:
	SymbolInfo( const UFC::AnsiString Sym, int pseq, int decimal )
	:Symbol( Sym )
	,Index( pseq )
	,DecimalLocator( decimal ){}
};
//------------------------------------------------------------------------------------------------------
class FutP08Loader :public UFC::FileChangedListrner
{
public: ///< Implement interface PStream.
    virtual ~FutP08Loader() {}
	virtual void OnFileChanged( const UFC::AnsiString& FileName, void* data );
};
//------------------------------------------------------------------------------------------------------
class OptP08Loader :public UFC::FileChangedListrner
{
public: ///< Implement interface PStream.
    virtual ~OptP08Loader() {}
	virtual void OnFileChanged( const UFC::AnsiString& FileName, void* data );
};
//------------------------------------------------------------------------------------------------------
class TMPR01Message;
class TMPR07Message;
class TMPR09Message;
class TMPRX01Message;
class TMPRX07Message;
class TMPRX09Message;
//------------------------------------------------------------------------------------------------------
class TMPMessage
{
private:  
    static UFC::PCriticalSection  SymbolLock;
    static FutP08Loader   FUTLoader; 
    static OptP08Loader   OPTLoader; 
    static TMPDataFormat* Formats[ 256 ];
    static BOOL           EnableCheckSum;
    static BOOL           EnableFLEX;
    static BOOL           OptionMarket;    
    static UFC::PHashedList<UFC::AnsiString, TMPDataFormat*> FormatMap;
    ///< For FCM
    static UFC::AnsiString                                   NoFCM;
    static UFC::PHashMap<UFC::AnsiString, int>               FCMMap;
    static UFC::PHashedList<int, UFC::AnsiString*>           FCMIndex;
    ///< For Symbols
    static UFC::AnsiString                                   NoOPTSymbol;
    static UFC::AnsiString                                   NoFUTSymbol;
    static UFC::PHashedList<UFC::AnsiString, SymbolInfo*>    SymbolMap;
    static UFC::PHashedList<int, SymbolInfo*>                FUTSymbolIndex;
    static UFC::PHashedList<int, SymbolInfo*>                OPTSymbolIndex;
    static UFC::PHashedList<int, SymbolInfo*>                FUTOffHourSymbolIndex;
    static UFC::PHashedList<int, SymbolInfo*>                OPTOffHourSymbolIndex;
    static UFC::PHashMap<UFC::AnsiString, int>               URLMap;
    static UFC::UDateTime                                    FUTP06Time;     
    static UFC::UDateTime                                    FUTP07Time;         
    static UFC::UDateTime                                    FUTP08Time;                 
    static UFC::UDateTime                                    OPTP06Time;     
    static UFC::UDateTime                                    OPTP07Time;         
    static UFC::UDateTime                                    OPTP08Time;             
    static BOOL                                              IsFUTPA7;
    static BOOL                                              IsOPTPA7;
public:    
    static UFC::UDateTime                                    FUTOffHourP08Time;
    static UFC::UDateTime                                    OPTOffHourP08Time;                 
private: ///< TMP Header members.
    TMPUInt16 FMsgLen;       ///< 2
    TMPUInt32 FMsgSeq;
    TMPTime   FMsgTime;
    TMPUInt8  FMsgType;        
    TMPUInt16 FFCMID;
    TMPUInt16 FSessionID;
    TMPUInt8  FCheckSum; 
private:        
    /**
     * Fields container
     */
    UFC::PtrList<TMPType> FFields;
    /**
     * Message format object.
     */
    TMPDataFormat*        FFormat;
private:      
    UInt8 HeaderCheckSum( void );
    UInt8 BodyCheckSum( void );
    UInt8 CalculateCheckSum( UInt8* Data, Int32 Length );
    void  SpiltNameValue( const UFC::AnsiString& Line, UFC::AnsiString& Name, UFC::AnsiString& Value );
    TMPMessage( void ){}
public:    
    static void LoadP08File(  BOOL IsOptions, BOOL IsOffHour, const UFC::AnsiString& File,const UFC::AnsiString& Format );        
private:                
    static BOOL LoadFCMFromFile( BOOL IsOptions, const UFC::AnsiString& FileOrDirName  );
    static void LoadSymbolFromFile( BOOL IsOptions, const UFC::AnsiString& FileOrDirName, const UFC::AnsiString& CfgDir );    
#ifndef _FOR_FCM
    static void LoadFCMFromSQLite( const UFC::AnsiString& FileOrDirName  );
    static int  SQLiteFCMcallback( void* count, int argc, char **argv, char ** azColName );
    static void LoadSymbolFromSQLite( const UFC::AnsiString& FileOrDirName  );
    static int  SQLiteSymbolcallback( void* count, int argc, char **argv, char ** azColName );
#endif
public:
    /**     
     * Constructor
     * Construct a TMP message from Name=Value sytle string.
     * or use a message name to create a TMP Message.( Like "L10", "R01"... )     
     */
    TMPMessage( const UFC::AnsiString& TMPstring );    
    /**     
     * Constructor
     * Construct a TMP message from binary stream.
     */    
    TMPMessage( UFC::PStream* Stream );        

    /**     
     * Constructor
     * Construct a TMP message from binary stream.
     * Add By Zhen Fan 2009.04.20
     */
    TMPMessage( UFC::PStream* Stream, UFC::AnsiString BrokerOrClearMemberType );

    /**     
     * Constructor
     * Use message type to create a TMP message.
     */    
    TMPMessage( TMPMessageType Type );
    /**
     * Copy Constructor
     * Use existing message to create a TMP message.
     */
    TMPMessage( TMPMessage& Src );
    /**     
     * Destructor     
     */        
    ~TMPMessage( void );
    /**
     * Get the TMP message create time.
     */
    TMPTime&  GetMessageTime( void ) { return FMsgTime; }
    /**
     * Get the unique sequence number of this TMP message.
     */
	UInt32  GetMessageSeq( void ) { return FMsgSeq.ToInteger(); }
    /**
     * Set this TMP message unique sequence number.
     */
    void    SetMessageSeq( UInt32 Seq ) { FMsgSeq = Seq; }
    /**
     * Get this TMP message type.
     */
    TMPMessageType GetMessageType( void ) { return (TMPMessageType)FMsgType.ToInteger(); }
    /**
     * Get the Session FCM Index of this message.
     */
	UInt16  GetFCMID( void )          { return FFCMID.ToInteger(); }
    /**
     * Set the Session FCM Index of this message.
     */
    void    SetFCMID( UInt16 FCMID)   { FFCMID  = TMPUInt16( FCMID ); }
    /**
     * Get the SessionID of this message.
     */
	UInt16  GetSessionID( void )      { return FSessionID.ToInteger(); }
    /**
     * Set the SessionID of this message.
     */
    void    SetSessionID( UInt16 SID) { FSessionID  = TMPUInt16( SID ); }
    /**
     * Serialize this TMP message to stream.
     */
    Int32    ToStream( UFC::PStream* Stream );
    /**
     * Convert this TMP message to string.
     */
    Int32    ToString(  UFC::AnsiString& TMPString  );
    Int32    ToStreamString( UFC::PStream* Stream, UFC::AnsiString& TMPString );
    /**
     * Check TMP message field existence.
     */
    BOOL     FieldExists( const UFC::AnsiString& Name );
    /**
     * Get TMP message field by name.
     */    
    TMPType* GetField( const UFC::AnsiString& Name );
    /**
     * Get TMP message field by index.
     */
    TMPType* GetField( Int32 Index );
    /**
     * Get TMP message size. (Binary size)
     */    
    Int32    GetMessageSize( void );
    Int32    GetMessageFullSize( void ) { return GetMessageSize( ) + TMP_SIZE_DIFF; }
    /**
     * Set TMP message field value by field name.
     *
     * @Param Name, Name of this field.
     * @Param Value, Value want to set.
     *        Char: Single character string
     *        CharArray: String.
     *        Int8,UInt8,Int16,UInt16,Int32,UInt32,Int64: Number string
     *        Time: String format HH:MM:SS.mmm.
     *        Symbol string: TAIFEX symbol string.
     *        Symbol Binary: String format Leg1ID,Leg2ID,Leg1Side,Leg2Side,CombOP 
     *    
     *        (* You can use this function to set value for all TMP types.)        
     */
    void     SetField( const AnsiString& Name, const AnsiString& Value );    
    /**
     * Set TMP message field value by index.
     */
    void     SetField( Int32 Index, const AnsiString& Value );
    void     SetField( Int32 Index, TMPType& Value );
    void     SetField( Int32 Index, TMPType* Value );
    /**
     * Set TMP message field value by field name.
     *
     * @Param Name, Name of this field.
     * @Param Value, Value want to set.
     *        Support types:
     *        Char,Int8,UInt8,Int16,UInt16,Int32,UInt32,Int64
     *         
     *        Not Support types: 
     *        Time,Symbol,CharArray
     */
    void     SetField( const AnsiString& Name, Int32 Value );
    void     SetField( const AnsiString& Name, TMPType& Value );
    void     SetField( const AnsiString& Name, TMPType* Value );
    /**
     * Set TMP message field value by index.
     */
    void     SetField( Int32 Index, Int32 Value );
    void     UpdateTime( void ) { FMsgTime.CurrentTime(); }
public:    
    /**
     * Operator [ index ]
     * Get TMP message field by index.
     */
    TMPType&   operator [] (const int index);
    /**
     * Operator [ Name ]
     * Get TMP message field by name string.
     */
    TMPType&   operator [] (const UFC::AnsiString& Name );    
public:    
    /**
     * Initialize TMP message library.
     *
     * @Param [in]LibraryMarket, Initialize library for Futures, Options or both system.
     *
     */
    static void        InitTMPMessageLibrary( const TMPLibMarket LibraryMarket );
    /**
     * Initialize the TMP BrokerID+SessionID map to URL lookup table. Load from file P07.BrokerID
     *
     * @Param [in]IsOptions, For Futures or Options system.
     * @Param [in]BrokerID, For this broker.
     */
    static void        LoadURLTable( BOOL IsOptions, const UFC::AnsiString& BrokerID );
    /**
     * lookup the TAIFEX TMP server URL and port.
     *
     * @Param [in]IsOptions, For Futures or Options system.
     * @Param [in]BrokerID,  BrokerID of this session.
     * @Param [in]SessionID, SessionID of this session.
     * @Param [in]Backup,    Backup URL/Port for this session.
     * @Param [Out]URL,      URL of this session.
     * @Param [Out]Port,     Server port of this session.
     * @Param [in]IsTEST,    Connection to testing environment.(default FALSE)
     * @Param [in]IsCM,      Is a ClearMameber session.(default FALSE)
     * @Param [in]IsOffHour, Is a off hour trading session
     */
    static BOOL        GetURLPort( BOOL IsOptions, const UFC::AnsiString& BrokerID, UInt16 SessionID, Int32 Backup, UFC::AnsiString& URL, UInt16& Port, BOOL IsTEST, BOOL IsCM , BOOL IsOffHour );

