shawn83924/SpeedySolution/TAIFEXLib/TMPMessage.h
public:
    /**
     * Get BorkerID index from  BorkerID string .
     */
    static UInt16                 GetBrokerID( const UFC::AnsiString& BrokerID );
    /**
     * Get BorkerID String by index.
     */    
    static const UFC::AnsiString& GetBrokerID( UInt16 Index );
    /**
     * Get CMID in index mode.
     */
    static UInt16                 GetCMID( const UFC::AnsiString& CMID, const UFC::AnsiString& BrokerID );
    /**
     * Get Symbol index from Symbol string .
     */
    static UInt16                 GetSymbol( const UFC::AnsiString& Symbol );
    static UInt16                 GetSymbol( const UFC::AnsiString& Symbol, int& Decimal );
    static BOOL                   SymbolExists( const UFC::AnsiString& Symbol );
    /**
     * Get BorkerID String by index.
     */    
    static const UFC::AnsiString& GetSymbol( BOOL IsOptions, BOOL IsOffHour, UInt16 Index );
    static BOOL                   SymbolExists( BOOL IsOptions, BOOL IsOffHour, UInt16 Index );
    /**
     * Enable/Disable checksum.
     */
    static void                   SetEnableCheckSum( BOOL Enabled )  { EnableCheckSum = Enabled; }
    static BOOL                   IsCheckSumEnabled( void )          { return EnableCheckSum; }    
    /**
     * Enable/Disable FLEX.
     */
    static void                   SetEnableFLEX( BOOL Enabled )  { EnableFLEX = Enabled; }
    static BOOL                   IsFLEXEnabled( void )          { return EnableFLEX; }    
    /**
     * Binary data to Hex string.( example:0xAF345 )
     */
    static void                   ToHexString( UFC::AnsiString& Result, UInt8* Data, Int32 Length );
    static UFC::UDateTime&        GetP06FileTime( BOOL IsOpt )       { return IsOpt? OPTP06Time:FUTP06Time; }     
    static UFC::UDateTime&        GetP07FileTime( BOOL IsOpt )       { return IsOpt? OPTP07Time:FUTP07Time; }         
    static UFC::UDateTime&        GetP08FileTime( BOOL IsOpt )       { return IsOpt? OPTP08Time:FUTP08Time; }
    static UFC::UDateTime&        GetOffHourP08FileTime( BOOL IsOpt ){ return IsOpt? OPTOffHourP08Time:FUTOffHourP08Time; }    
    static BOOL                   IsLoadPA7( BOOL IsOpt )            { return IsOpt? IsOPTPA7:IsFUTPA7; }

    static PThreadObjectPool<TMPR01Message>* R01PoolPtr;  //Add by Zhen Fan 2021/05/20
    static PThreadObjectPool<TMPR07Message>* R07PoolPtr;  //Add by Zhen Fan 2021/05/20
    static PThreadObjectPool<TMPR09Message>* R09PoolPtr;  //Add by Zhen Fan 2021/05/20
    static PThreadObjectPool<TMPRX01Message>* RX01PoolPtr; 
    static PThreadObjectPool<TMPRX07Message>* RX07PoolPtr; 
    static PThreadObjectPool<TMPRX09Message>* RX09PoolPtr; 
    static void InitializeThreadPool();  //Add by Zhen Fan 2021/05/20
};
//------------------------------------------------------------------------------------------------------
class FastTMPMessage
{
public:     
    virtual ~FastTMPMessage() {}
    virtual const UInt8* GetBytes( void ) = 0;
    virtual int    Length( void )   = 0;
    virtual void   Update( UFC::UInt16 fcmid, UFC::UInt16 sid, UFC::Int32& seq ) = 0;
    virtual int    ToString( char* Buf, int Len ) = 0;
    virtual TMPMessageType GetMessageType( void ) = 0;
    virtual char   GetExecType( void ) = 0;
    virtual void   SetExecType( char ) = 0;
    virtual int    GetFCMID( void ) = 0;
    virtual int    GetOrdID( void ) = 0;
    virtual void   GetOrderID( char* Out ) = 0;
    virtual void   Recycle( void )  = 0;
};
//------------------------------------------------------------------------------------------------------
class TMPR01Message : public FastTMPMessage
{
private:  ///< TMP Message header  
    UFC::RNUInt16    msg_length; ///< length 77(fixed)
    UFC::RNUInt32    MsgSeqNum;
    UFC::RNUInt32    epoch_s;
    UFC::RNUInt16    ms;
    UFC::RNUInt8     MessageType; ///< R01: 101(fixed)
    UFC::RNUInt16    fcm_id_h;    ///< fixed by session
    UFC::RNUInt16    session_id;  ///< fixed by session
private: ///< TMP Message body   
    UFC::RNChar      ExecType;
    UFC::RNUInt16    cm_id;
    UFC::RNUInt16    fcm_id;
    UFC::RNCharArray order_no;//[5];
    UFC::RNUInt32    ord_id;
    UFC::RNUInt64    user_define;
    UFC::RNUInt8     symbol_type;
    UFC::RNCharArray symbol;//[ 20 ];
    UFC::RNUInt32    Price;
    UFC::RNUInt16    qty;
    UFC::RNUInt32    investor_acno;
    UFC::RNChar      investor_flag;
    UFC::RNUInt8     Side;
    UFC::RNUInt8     Ordtype;
    UFC::RNUInt8     TimeInForce;
    UFC::RNChar      PositionEffect;
    UFC::RNChar      order_souce;
    UFC::RNCharArray info_souce;//[3];
private:        
    UFC::RNUInt8     CheckSum;
private:        
    UFC::UInt8       FRowData[128];
public:    
    TMPR01Message()
    :msg_length( FRowData , 0 ) ///< length 77(fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< R01: 101(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,ExecType( FRowData , 17 )
    ,cm_id( FRowData , 18 )
    ,fcm_id( FRowData , 20 )
    ,order_no( FRowData , 22, 5 )//[5];
    ,ord_id( FRowData , 27 )
    ,user_define( FRowData , 31 )
    ,symbol_type( FRowData , 39 )
    ,symbol( FRowData , 40, 20 )//[ 20 ];
    ,Price( FRowData , 60 )
    ,qty( FRowData , 64 )
    ,investor_acno( FRowData , 66 )
    ,investor_flag( FRowData , 70 )
    ,Side( FRowData , 71 )
    ,Ordtype( FRowData , 72 )
    ,TimeInForce( FRowData , 73 )
    ,PositionEffect( FRowData , 74 )
    ,order_souce( FRowData , 75 )
    ,info_souce( FRowData , 76, 3 )//[3];
    ,CheckSum( FRowData , 79 )    
    {
        msg_length.Set( 77 );
        MessageType.Set( 101 );
    }
    TMPR01Message( TMPR01Message& Ref )
    :msg_length( FRowData , 0 ) ///< length 77(fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< R01: 101(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,ExecType( FRowData , 17 )
    ,cm_id( FRowData , 18 )
    ,fcm_id( FRowData , 20 )
    ,order_no( FRowData , 22, 5 )//[5];
    ,ord_id( FRowData , 27 )
    ,user_define( FRowData , 31 )
    ,symbol_type( FRowData , 39 )
    ,symbol( FRowData , 40, 20 )//[ 20 ];
    ,Price( FRowData , 60 )
    ,qty( FRowData , 64 )
    ,investor_acno( FRowData , 66 )
    ,investor_flag( FRowData , 70 )
    ,Side( FRowData , 71 )
    ,Ordtype( FRowData , 72 )
    ,TimeInForce( FRowData , 73 )
    ,PositionEffect( FRowData , 74 )
    ,order_souce( FRowData , 75 )
    ,info_souce( FRowData , 76, 3 )//[3];
    ,CheckSum( FRowData , 79 )    
    {
        memcpy( FRowData, Ref.FRowData, 128 );
    }
    const UInt8*   GetBytes( void )        { return FRowData; }
    int            Length( void )          { return 80; } ///< 77 + msg_length(2) + CheckSum(1)
    void           Update( UFC::UInt16 fcmid, UFC::UInt16 sid, UFC::Int32& seq );    
    int            ToString( char* Buf, int Len );
    TMPMessageType GetMessageType( void )  { return tmtR01; }
    char           GetExecType( void )     { return ExecType.Get(); }
    void           SetExecType( char tp )  { ExecType.Set( tp); }
    int            GetFCMID( void )        { return fcm_id.Get(); }
    int            GetOrdID( void )        { return ord_id.Get(); }
    void           GetOrderID( char* Out ) { order_no.Get(Out); }
    void           Recycle( void );  //Add by Zhen Fan 2021/05/20
public:
    void Set_ExecType( char exectype )        { ExecType.Set(exectype); }
    void Set_cm_id( UFC::UInt16 cmid )        { cm_id.Set(cmid); }
    void Set_fcm_id( UFC::UInt16 fcmid )      { fcm_id.Set(fcmid); }
    void Set_order_no( const char* oid )      { order_no.Set( oid); }
    void Set_ord_id( UFC::UInt32 oid )        { ord_id.Set(oid); }
    void Set_user_define( UFC::UInt64 udd )   { user_define.Set(udd); }
    void Set_symbol_type( UFC::UInt8 st )     { symbol_type.Set(st); }  
    void Set_symbol( const char* sym)         { symbol.Set(sym); }
    void Set_Price( UFC::UInt32 px )          { Price.Set(px); }
    void Set_qty( UFC::UInt16 Qty  )          { qty.Set(Qty); }
    void Set_investor_acno( UFC::UInt32 acno ){ investor_acno.Set(acno); }
    void Set_investor_flag( char flag )       { investor_flag.Set(flag); }
    void Set_Side( UFC::UInt8 side )          { Side.Set(side); }  
    void Set_Ordtype( UFC::UInt8 ot)          { Ordtype.Set(ot); }
    void Set_TimeInForce( UFC::UInt8 tif)     { TimeInForce.Set(tif); }
    void Set_PositionEffect( char pe )        { PositionEffect.Set(pe); }
    void Set_order_souce( char oc )           { order_souce.Set(oc); }
    void Set_info_souce( const char* is)      { info_souce.Set(is); }
    
