shawn83924/SpeedySolution/TAIFEXLib/TMPMessage.h
};        
//------------------------------------------------------------------------------------------------------
class TMPR07Message : public FastTMPMessage
{
private: ///< TMP Message header   
    UFC::RNUInt16     msg_length; ///< length 51(fixed)
    UFC::RNUInt32     MsgSeqNum;
    UFC::RNUInt32     epoch_s;
    UFC::RNUInt16     ms;
    UFC::RNUInt8      MessageType; ///< R07: 107(fixed)
    UFC::RNUInt16     fcm_id_h;    ///< fixed by session
    UFC::RNUInt16     session_id;  ///< fixed by session
private: ///< TMP Message body    
    UFC::RNCharArray  order_no;//[5];
    UFC::RNUInt32     ord_id;
    UFC::RNUInt16     fcm_id;
    UFC::RNUInt8      symbol_type;
    UFC::RNCharArray  symbol;//[ 20 ];
    UFC::RNChar       order_souce;
    UFC::RNCharArray  info_souce;//[3];
private:        
    UFC::RNUInt8      CheckSum;
private:        
    UFC::UInt8       FRowData[64];    
public:    
    TMPR07Message()
    :msg_length( FRowData , 0 ) ///< length 51(fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< R07: 107(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,order_no( FRowData , 17 , 5)
    ,ord_id( FRowData , 22 )
    ,fcm_id( FRowData , 26 )
    ,symbol_type( FRowData , 28 )
    ,symbol( FRowData , 29, 20 )
    ,order_souce( FRowData , 49 )
    ,info_souce( FRowData , 50, 3 )
    ,CheckSum( FRowData , 53 )    
    {
        msg_length.Set( 51 );
        MessageType.Set( 107 );
    }    
    TMPR07Message( TMPR07Message& Ref )
    :msg_length( FRowData , 0 ) ///< length 51(fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< R07: 107(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,order_no( FRowData , 17 , 5)
    ,ord_id( FRowData , 22 )
    ,fcm_id( FRowData , 26 )
    ,symbol_type( FRowData , 28 )
    ,symbol( FRowData , 29, 20 )
    ,order_souce( FRowData , 49 )
    ,info_souce( FRowData , 50, 3 )
    ,CheckSum( FRowData , 53 )    
    {
        memcpy( FRowData, Ref.FRowData, 64 );
    }  
    const UInt8* GetBytes( void ) { return FRowData; }
    int          Length( void )   { return 54; } ///< 51 + msg_length(2) + CheckSum(1)
    void         Update( UFC::UInt16 fcmid, UFC::UInt16 sid, UFC::Int32& seq );    
    int         ToString( char* Buf, int Len );
    TMPMessageType GetMessageType( void ) { return tmtR07; }    
    char           GetExecType( void )     { return '0'; }
    void           SetExecType( char tp )  { }
    int            GetFCMID( void )        { return fcm_id.Get(); }
    int            GetOrdID( void )        { return ord_id.Get(); }
    void           GetOrderID( char* Out ) { order_no.Get(Out); }
    void           Recycle( void );  //Add by Zhen Fan 2021/05/20
public:        
    void Set_fcm_id( UFC::UInt16 fcmid )      { fcm_id.Set(fcmid); }
    void Set_order_no( const char* oid )      { order_no.Set(oid); }
    void Set_ord_id( UFC::UInt32 oid )        { ord_id.Set(oid); }
    void Set_symbol_type( UFC::UInt8 st )     { symbol_type.Set(st); }  
    void Set_symbol( const char* sym)         { symbol.Set(sym); }
    void Set_order_souce( char oc )           { order_souce.Set(oc); }
    void Set_info_souce( const char* is)      { info_souce.Set(is); }
    
};    
//------------------------------------------------------------------------------------------------------
class TMPR09Message : public FastTMPMessage
{
private: ///< TMP Message header   
    UFC::RNUInt16    msg_length; ///< length 81 (fixed)
    UFC::RNUInt32    MsgSeqNum;
    UFC::RNUInt32    epoch_s;
    UFC::RNUInt16    ms;
    UFC::RNUInt8     MessageType; ///< R01: 109(fixed)
    UFC::RNUInt16    fcm_id_h;    ///< fixed by session
    UFC::RNUInt16    session_id;  ///< fixed by session
private: ///< TMP Message body   
    UFC::RNChar      ExecType;
    UFC::RNUInt16    cm_id;
    UFC::RNUInt16    fcm_id;
    UFC::RNCharArray order_no;//[5];
    UFC::RNUInt32    ord_id;
    UFC::RNUInt64    user_define;
    UFC::RNUInt8     symbol_type;
    UFC::RNCharArray symbol;//[ 20 ];
    UFC::RNUInt32    BidPx;
    UFC::RNUInt32    OfferPx;
    UFC::RNUInt16    BidSize;
    UFC::RNUInt16    OfferSize;
    UFC::RNUInt32    investor_acno;
    UFC::RNChar      investor_flag;
    UFC::RNUInt8     TimeInForce;
    UFC::RNChar      PositionEffect;
    UFC::RNChar      order_souce;
    UFC::RNCharArray info_souce;//[3];
private:        
    UFC::RNUInt8     CheckSum;
private:        
    UFC::UInt8       FRowData[128];
public:    
    TMPR09Message()
    :msg_length( FRowData , 0 ) ///< length 81 (fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< R09: 109(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,ExecType( FRowData , 17 )
    ,cm_id( FRowData , 18 )
    ,fcm_id( FRowData , 20 )
    ,order_no( FRowData , 22 ,5 )//[5];
    ,ord_id( FRowData , 27 )
    ,user_define( FRowData , 31 )
    ,symbol_type( FRowData , 39 )
    ,symbol( FRowData , 40, 20 )//[ 20 ];
    ,BidPx( FRowData , 60 )
    ,OfferPx( FRowData , 64 )
    ,BidSize( FRowData , 68 )
    ,OfferSize( FRowData , 70 )
    ,investor_acno( FRowData , 72 )
    ,investor_flag( FRowData , 76 )
    ,TimeInForce( FRowData , 77 )
    ,PositionEffect( FRowData , 78 )
    ,order_souce( FRowData , 79 )
    ,info_souce( FRowData , 80,3 )//[3];
    ,CheckSum( FRowData , 83 )
    {
        msg_length.Set( 81 );
        MessageType.Set( 109 );
    }
    TMPR09Message( TMPR09Message& Ref )
    :msg_length( FRowData , 0 ) ///< length 81 (fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< R09: 109(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,ExecType( FRowData , 17 )
    ,cm_id( FRowData , 18 )
    ,fcm_id( FRowData , 20 )
    ,order_no( FRowData , 22 ,5 )//[5];
    ,ord_id( FRowData , 27 )
    ,user_define( FRowData , 31 )
    ,symbol_type( FRowData , 39 )
    ,symbol( FRowData , 40, 20 )//[ 20 ];
    ,BidPx( FRowData , 60 )
    ,OfferPx( FRowData , 64 )
    ,BidSize( FRowData , 68 )
    ,OfferSize( FRowData , 70 )
    ,investor_acno( FRowData , 72 )
    ,investor_flag( FRowData , 76 )
    ,TimeInForce( FRowData , 77 )
    ,PositionEffect( FRowData , 78 )
    ,order_souce( FRowData , 79 )
    ,info_souce( FRowData , 80,3 )//[3];
    ,CheckSum( FRowData , 83 )
    {
        memcpy( FRowData, Ref.FRowData, 128 );
    }
    const UInt8* GetBytes( void ) { return FRowData; }
    int          Length( void )   { return 84; } ///< 81 + msg_length(2) + CheckSum(1)
    void         Update( UFC::UInt16 fcmid, UFC::UInt16 sid, UFC::Int32& seq );
    int         ToString( char* Buf, int Len );
    TMPMessageType GetMessageType( void ) { return tmtR09; }
    char           GetExecType( void )     { return ExecType.Get(); }
    void           SetExecType( char tp )  { ExecType.Set( tp); }
    int            GetFCMID( void )        { return fcm_id.Get(); }
    int            GetOrdID( void )        { return ord_id.Get(); }
    void           GetOrderID( char* Out ) { order_no.Get(Out); }
    void           Recycle( void );  //Add by Zhen Fan 2021/05/20
public:
    void Set_ExecType( char exectype )        { ExecType.Set(exectype); }
    void Set_cm_id( UFC::UInt16 cmid )        { cm_id.Set(cmid); }
    void Set_fcm_id( UFC::UInt16 fcmid )      { fcm_id.Set(fcmid); }
    void Set_order_no( const char* oid )      { order_no.Set(oid); }
    void Set_ord_id( UFC::UInt32 oid )        { ord_id.Set(oid); }
    void Set_user_define( UFC::UInt64 udd )   { user_define.Set(udd); }
    void Set_symbol_type( UFC::UInt8 st )     { symbol_type.Set(st); }  
    void Set_symbol( const char* sym)         { symbol.Set(sym); }
    void Set_BidPx( UFC::UInt32 px )          { BidPx.Set(px); }
    void Set_OfferPx( UFC::UInt32 px )        { OfferPx.Set(px); }
    void Set_BidSize( UFC::UInt16 Qty  )      { BidSize.Set(Qty); }
    void Set_OfferSize( UFC::UInt16 Qty  )    { OfferSize.Set(Qty); }
    void Set_investor_acno( UFC::UInt32 acno ){ investor_acno.Set(acno); }
    void Set_investor_flag( char flag )       { investor_flag.Set(flag); }    
    void Set_TimeInForce( UFC::UInt8 tif)     { TimeInForce.Set(tif); }
    void Set_PositionEffect( char pe )        { PositionEffect.Set(pe); }
    void Set_order_souce( char oc )           { order_souce.Set(oc); }
    void Set_info_souce( const char* is)      { info_souce.Set(is); }    
};        
//------------------------------------------------------------------------------------------------------
class TMPRX01Message : public FastTMPMessage
{
private:  ///< TMP Message header  
    UFC::RNUInt16    msg_length; ///< length 77(fixed)
    UFC::RNUInt32    MsgSeqNum;
    UFC::RNUInt32    epoch_s;
    UFC::RNUInt16    ms;
    UFC::RNUInt8     MessageType; ///< R01: 101(fixed)
    UFC::RNUInt16    fcm_id_h;    ///< fixed by session
    UFC::RNUInt16    session_id;  ///< fixed by session
private: ///< TMP Message header Ex     
    UFC::RNUInt8     MsgTypeExt; 
    UFC::RNUInt8     preserve; 
    UFC::RNUInt32    msg_time_ns;
private: ///< TMP Message body   
    UFC::RNChar      ExecType;
    UFC::RNUInt16    cm_id;
    UFC::RNUInt16    fcm_id;
    UFC::RNCharArray order_no;//[5];
    UFC::RNUInt32    ord_id;
    UFC::RNUInt64    user_define;
    UFC::RNCharArray symbol;//[ 20 ];
    UFC::RNUInt32    Price;
    UFC::RNUInt16    qty;
    UFC::RNUInt32    investor_acno;
    UFC::RNChar      investor_flag;
    UFC::RNUInt8     Side;
    UFC::RNUInt8     Ordtype;
    UFC::RNUInt8     TimeInForce;
    UFC::RNChar      PositionEffect;    
    UFC::RNCharArray filler;//[12];
private:        
    UFC::RNUInt8     CheckSum;
private:        
    UFC::UInt8       FRowData[128];
public:    
    TMPRX01Message()
    :msg_length( FRowData , 0 ) ///< length 89(fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< RX01: 201(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,MsgTypeExt( FRowData , 17 )
    ,preserve( FRowData , 18 )
    ,msg_time_ns( FRowData , 19 )
    ,ExecType( FRowData , 23 )
    ,cm_id( FRowData , 24 )
    ,fcm_id( FRowData , 26 )
    ,order_no( FRowData , 28, 5 )//[5];
    ,ord_id( FRowData , 33 )
    ,user_define( FRowData , 37 )
    ,symbol( FRowData , 45, 20 )//[ 20 ];
    ,Price( FRowData , 65 )
    ,qty( FRowData , 69 )
    ,investor_acno( FRowData , 71 )
    ,investor_flag( FRowData , 75 )
    ,Side( FRowData , 76 )
    ,Ordtype( FRowData , 77 )
    ,TimeInForce( FRowData , 78 )
    ,PositionEffect( FRowData , 79 )    
    ,filler( FRowData , 80, 12 )//[3];
    ,CheckSum( FRowData , 92 )    
    {
        msg_length.Set( 90 );
        MessageType.Set( 201 );
        preserve.Set( 0 );
        MsgTypeExt.Set( 2 ); ///< Text Mode        
    }
    TMPRX01Message( TMPRX01Message& Ref )
    :msg_length( FRowData , 0 ) ///< length 89(fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< RX01: 201(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,MsgTypeExt( FRowData , 17 )
    ,preserve( FRowData , 18 )
    ,msg_time_ns( FRowData , 19 )
    ,ExecType( FRowData , 23 )
    ,cm_id( FRowData , 24 )
    ,fcm_id( FRowData , 26 )
    ,order_no( FRowData , 28, 5 )//[5];
    ,ord_id( FRowData , 33 )
    ,user_define( FRowData , 37 )
    ,symbol( FRowData , 45, 20 )//[ 20 ];
    ,Price( FRowData , 65 )
    ,qty( FRowData , 69 )
    ,investor_acno( FRowData , 71 )
    ,investor_flag( FRowData , 75 )
    ,Side( FRowData , 76 )
    ,Ordtype( FRowData , 77 )
    ,TimeInForce( FRowData , 78 )
    ,PositionEffect( FRowData , 79 )    
    ,filler( FRowData , 80, 12 )//[3];
    ,CheckSum( FRowData , 92 )    
    {
        memcpy( FRowData, Ref.FRowData, 128 );
    }
    const UInt8*   GetBytes( void )        { return FRowData; }
    int            Length( void )          { return 93; } ///< 90 + msg_length(2) + CheckSum(1)
    void           Update( UFC::UInt16 fcmid, UFC::UInt16 sid, UFC::Int32& seq );    
    int            ToString( char* Buf, int Len );
    TMPMessageType GetMessageType( void )  { return tmtRX01; }
    char           GetExecType( void )     { return ExecType.Get(); }
    void           SetExecType( char tp )  { ExecType.Set( tp); }
    int            GetFCMID( void )        { return fcm_id.Get(); }
    int            GetOrdID( void )        { return ord_id.Get(); }
    void           GetOrderID( char* Out ) { order_no.Get(Out); }
    void           Recycle( void ); 
public:
    void Set_ExecType( char exectype )        { ExecType.Set(exectype); }
    void Set_cm_id( UFC::UInt16 cmid )        { cm_id.Set(cmid); }
    void Set_fcm_id( UFC::UInt16 fcmid )      { fcm_id.Set(fcmid); }
    void Set_order_no( const char* oid )      { order_no.Set( oid); }
    void Set_ord_id( UFC::UInt32 oid )        { ord_id.Set(oid); }
    void Set_user_define( UFC::UInt64 udd )   { user_define.Set(udd); }
    void Set_symbol( const char* sym)         { symbol.Set(sym); }
    void Set_Price( UFC::UInt32 px )          { Price.Set(px); }
    void Set_qty( UFC::UInt16 Qty  )          { qty.Set(Qty); }
    void Set_investor_acno( UFC::UInt32 acno ){ investor_acno.Set(acno); }
    void Set_investor_flag( char flag )       { investor_flag.Set(flag); }
    void Set_Side( UFC::UInt8 side )          { Side.Set(side); }  
    void Set_Ordtype( UFC::UInt8 ot)          { Ordtype.Set(ot); }
    void Set_TimeInForce( UFC::UInt8 tif)     { TimeInForce.Set(tif); }
    void Set_PositionEffect( char pe )        { PositionEffect.Set(pe); }   
};        
//------------------------------------------------------------------------------------------------------
class TMPRX07Message : public FastTMPMessage
{
private: ///< TMP Message header   
    UFC::RNUInt16     msg_length; ///< length 51(fixed)
    UFC::RNUInt32     MsgSeqNum;
    UFC::RNUInt32     epoch_s;
    UFC::RNUInt16     ms;
    UFC::RNUInt8      MessageType; ///< R07: 107(fixed)
    UFC::RNUInt16     fcm_id_h;    ///< fixed by session
    UFC::RNUInt16     session_id;  ///< fixed by session
private: ///< TMP Message header Ex     
    UFC::RNUInt8     MsgTypeExt; 
    UFC::RNUInt8     preserve; 
    UFC::RNUInt32    msg_time_ns;    
private: ///< TMP Message body    
    UFC::RNCharArray  order_no;//[5];
    UFC::RNUInt32     ord_id;
    UFC::RNUInt16     fcm_id;
    UFC::RNCharArray  symbol;//[ 20 ];
    UFC::RNCharArray  filler;//[ 8 ];
private:        
    UFC::RNUInt8      CheckSum;
private:        
    UFC::UInt8       FRowData[64];    
public:    
    TMPRX07Message()
    :msg_length( FRowData , 0 ) ///< length 60(fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< RX07: 207(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,MsgTypeExt( FRowData , 17 )
    ,preserve( FRowData , 18 )
    ,msg_time_ns( FRowData , 19 )    
    ,order_no( FRowData , 23 , 5)
    ,ord_id( FRowData , 28 )
    ,fcm_id( FRowData , 32 )
    ,symbol( FRowData , 34, 20 )
    ,filler( FRowData , 54, 8 )
    ,CheckSum( FRowData , 62 )    
    {
        msg_length.Set( 60 );
        MessageType.Set( 207 );
        preserve.Set( 0 );
        MsgTypeExt.Set( 2 ); ///< Text Mode
    }    
    TMPRX07Message( TMPRX07Message& Ref )
    :msg_length( FRowData , 0 ) ///< length 60(fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< RX07: 207(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,MsgTypeExt( FRowData , 17 )
    ,preserve( FRowData , 18 )
    ,msg_time_ns( FRowData , 19 )    
    ,order_no( FRowData , 23 , 5)
    ,ord_id( FRowData , 28 )
    ,fcm_id( FRowData , 32 )
    ,symbol( FRowData , 34, 20 )
    ,filler( FRowData , 54, 8 )
    ,CheckSum( FRowData , 62 )    
    {
        memcpy( FRowData, Ref.FRowData, 64 );
    }  
    const UInt8* GetBytes( void ) { return FRowData; }
    int          Length( void )   { return 63; } ///< 60 + msg_length(2) + CheckSum(1)
    void         Update( UFC::UInt16 fcmid, UFC::UInt16 sid, UFC::Int32& seq );    
    int         ToString( char* Buf, int Len );
    TMPMessageType GetMessageType( void ) { return tmtRX07; }    
    char           GetExecType( void )     { return '0'; }
    void           SetExecType( char tp )  { }
    int            GetFCMID( void )        { return fcm_id.Get(); }
    int            GetOrdID( void )        { return ord_id.Get(); }
    void           GetOrderID( char* Out ) { order_no.Get(Out); }
    void           Recycle( void ); 
public:        
    void Set_fcm_id( UFC::UInt16 fcmid )      { fcm_id.Set(fcmid); }
    void Set_order_no( const char* oid )      { order_no.Set(oid); }
    void Set_ord_id( UFC::UInt32 oid )        { ord_id.Set(oid); }
    void Set_symbol( const char* sym)         { symbol.Set(sym); }
};    
//------------------------------------------------------------------------------------------------------
class TMPRX09Message : public FastTMPMessage
{
private: ///< TMP Message header   
    UFC::RNUInt16    msg_length; ///< length 81 (fixed)
    UFC::RNUInt32    MsgSeqNum;
    UFC::RNUInt32    epoch_s;
    UFC::RNUInt16    ms;
    UFC::RNUInt8     MessageType; ///< RX09: 209(fixed)
    UFC::RNUInt16    fcm_id_h;    ///< fixed by session
    UFC::RNUInt16    session_id;  ///< fixed by session
private: ///< TMP Message header Ex     
    UFC::RNUInt8     MsgTypeExt; 
    UFC::RNUInt8     preserve; 
    UFC::RNUInt32    msg_time_ns;        
private: ///< TMP Message body   
    UFC::RNChar      ExecType;
    UFC::RNUInt16    cm_id;
    UFC::RNUInt16    fcm_id;
    UFC::RNCharArray order_no;//[5];
    UFC::RNUInt32    ord_id;
    UFC::RNUInt64    user_define;
    UFC::RNCharArray symbol;//[ 20 ];
    UFC::RNUInt32    BidPx;
    UFC::RNUInt32    OfferPx;
    UFC::RNUInt16    BidSize;
    UFC::RNUInt16    OfferSize;
    UFC::RNUInt32    investor_acno;
    UFC::RNChar      investor_flag;
    UFC::RNUInt8     TimeInForce;
    UFC::RNChar      PositionEffect;    
    UFC::RNCharArray filler;//[12];
private:        
    UFC::RNUInt8     CheckSum;
private:        
    UFC::UInt8       FRowData[128];
public:    
    TMPRX09Message()
    :msg_length( FRowData , 0 ) ///< length 94 (fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< RX09: 209(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,MsgTypeExt( FRowData , 17 )
    ,preserve( FRowData , 18 )
    ,msg_time_ns( FRowData , 19 )    
    ,ExecType( FRowData , 23 )
    ,cm_id( FRowData , 24 )
    ,fcm_id( FRowData , 26 )
    ,order_no( FRowData , 28 ,5 )//[5];
    ,ord_id( FRowData , 33 )
    ,user_define( FRowData , 37 )
    ,symbol( FRowData , 45, 20 )//[ 20 ];
    ,BidPx( FRowData , 65 )
    ,OfferPx( FRowData , 69 )
    ,BidSize( FRowData , 73 )
    ,OfferSize( FRowData , 75 )
    ,investor_acno( FRowData , 77 )
    ,investor_flag( FRowData , 81 )
    ,TimeInForce( FRowData , 82 )
    ,PositionEffect( FRowData , 83 )    
    ,filler( FRowData , 84, 12 )//[12];
    ,CheckSum( FRowData , 96 )
    {
        msg_length.Set( 94 );
        MessageType.Set( 209 );
        preserve.Set( 0 );
        MsgTypeExt.Set( 2 ); ///< Text Mode
    }
    TMPRX09Message( TMPRX09Message& Ref )
    :msg_length( FRowData , 0 ) ///< length 94 (fixed)
    ,MsgSeqNum( FRowData , 2 )
    ,epoch_s( FRowData , 6 )
    ,ms( FRowData , 10 )
    ,MessageType( FRowData , 12 ) ///< RX09: 209(fixed)
    ,fcm_id_h( FRowData , 13 )    ///< fixed by session
    ,session_id( FRowData , 15 )  ///< fixed by session
    ,MsgTypeExt( FRowData , 17 )
    ,preserve( FRowData , 18 )
    ,msg_time_ns( FRowData , 19 )    
    ,ExecType( FRowData , 23 )
    ,cm_id( FRowData , 24 )
    ,fcm_id( FRowData , 26 )
    ,order_no( FRowData , 28 ,5 )//[5];
    ,ord_id( FRowData , 33 )
    ,user_define( FRowData , 37 )
    ,symbol( FRowData , 45, 20 )//[ 20 ];
    ,BidPx( FRowData , 65 )
    ,OfferPx( FRowData , 69 )
    ,BidSize( FRowData , 73 )
    ,OfferSize( FRowData , 75 )
    ,investor_acno( FRowData , 77 )
    ,investor_flag( FRowData , 81 )
    ,TimeInForce( FRowData , 82 )
    ,PositionEffect( FRowData , 83 )    
    ,filler( FRowData , 84, 12 )//[12];
    ,CheckSum( FRowData , 96 )
    {
        memcpy( FRowData, Ref.FRowData, 128 );
    }
    const UInt8* GetBytes( void ) { return FRowData; }
    int          Length( void )   { return 97; } ///< 94 + msg_length(2) + CheckSum(1)
    void         Update( UFC::UInt16 fcmid, UFC::UInt16 sid, UFC::Int32& seq );
    int         ToString( char* Buf, int Len );
    TMPMessageType GetMessageType( void ) { return tmtR09; }
    char           GetExecType( void )     { return ExecType.Get(); }
    void           SetExecType( char tp )  { ExecType.Set( tp); }
    int            GetFCMID( void )        { return fcm_id.Get(); }
    int            GetOrdID( void )        { return ord_id.Get(); }
    void           GetOrderID( char* Out ) { order_no.Get(Out); }
    void           Recycle( void );  //Add by Zhen Fan 2021/05/20
public:
    void Set_ExecType( char exectype )        { ExecType.Set(exectype); }
    void Set_cm_id( UFC::UInt16 cmid )        { cm_id.Set(cmid); }
    void Set_fcm_id( UFC::UInt16 fcmid )      { fcm_id.Set(fcmid); }
    void Set_order_no( const char* oid )      { order_no.Set(oid); }
    void Set_ord_id( UFC::UInt32 oid )        { ord_id.Set(oid); }
    void Set_user_define( UFC::UInt64 udd )   { user_define.Set(udd); }
    void Set_symbol( const char* sym)         { symbol.Set(sym); }
    void Set_BidPx( UFC::UInt32 px )          { BidPx.Set(px); }
    void Set_OfferPx( UFC::UInt32 px )        { OfferPx.Set(px); }
    void Set_BidSize( UFC::UInt16 Qty  )      { BidSize.Set(Qty); }
    void Set_OfferSize( UFC::UInt16 Qty  )    { OfferSize.Set(Qty); }
    void Set_investor_acno( UFC::UInt32 acno ){ investor_acno.Set(acno); }
    void Set_investor_flag( char flag )       { investor_flag.Set(flag); }    
    void Set_TimeInForce( UFC::UInt8 tif)     { TimeInForce.Set(tif); }
    void Set_PositionEffect( char pe )        { PositionEffect.Set(pe); }
};        
//------------------------------------------------------------------------------------------------------
}
//------------------------------------------------------------------------------------------------------
#endif	/* _TMPMESSAGE_H */

